//使用函数实现：判断任意年份是否是平年

//使用函数实现：判断任意三位数是否是水仙花数

//使用函数实现：求出任意数的阶乘

/*
 使用函数实现：
 模拟点餐过程: 当你点面条的时候,如果钱数大于80,返回炸酱面,否则钱不够,打印差的钱数
              当你点盖饭的时候,如果钱数大于120,返回鱼香肉丝,否则打印钱不够
 */

//function daifan(money, food){			
//	if(food == "面条") {
//		if(money < 80) {
//		  alert("钱不够用！再给点，还差"+(80-money)+"元");
//		} else {
//		   return "炸酱面";
//		}
//	} else if(food == "盖饭") {
//		if(money < 120) {
//			alert("钱不够用");
//		} else {
//		   return "鱼香肉丝";
//		}
//	}
//}
//var food = daifan(100,"面条");
//document.write("food="+food);